In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

#### Selecting entries from a Series

In [3]:
ser1 = Series(np.arange(3), index=['A', 'B', 'C'])

# double every value in the series
ser1 = 2 * ser1

ser1

A    0
B    2
C    4
dtype: int32

In [5]:
# grab value by index name
ser1['B']

2

In [6]:
# grab value by index ordinal
ser1[1]

2

In [7]:
# grab value by index range
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [8]:
# grab value by range of index values
ser1[['A', 'B']]

A    0
B    2
dtype: int32

In [9]:
# grab value by boolean value of logic, get values where its greater than 3
ser1[ser1 > 3]

C    4
dtype: int32

In [10]:
# overwriting entries in the series
ser1[ser1 > 3] = 10

ser1

A     0
B     2
C    10
dtype: int32

#### Selecting entries from a Dataframe

In [11]:
dframe1 = DataFrame(np.arange(25).reshape(5,5), index=['NYC', 'LA', 'SF','DC', 'CHI'], 
                    columns=['A', 'B', 'C', 'D', 'E'])

dframe1

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [12]:
# select data by a column name
dframe1['B']

NYC     1
LA      6
SF     11
DC     16
CHI    21
Name: B, dtype: int32

In [13]:
# select data by list of column names
dframe1[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
CHI  21  24

In [15]:
# grab value by boolean value of logic, get values from column C where its greater than 8
dframe1[dframe1['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [17]:
# we can also show a boolean dataframe, it will just have boolean values true and false
dframe1 > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
CHI   True   True   True   True   True

In [19]:
dframe1

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
CHI  20  21  22  23  24

In [22]:
# select data by index name
dframe1.ix['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32

In [23]:
# select data by index ordinal
dframe1.ix[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int32